src/main/resources/templates/xml/create_client_address_v2.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:wsin="http://www.openwaygroup.com/wsint"
                  xmlns:th="http://www.thymeleaf.org"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <wsin:SessionContextStr th:text="${sessionContextStr}">?</wsin:SessionContextStr>
        <wsin:UserInfo th:text="${userInfo}">officer="WX_ADMIN"</wsin:UserInfo>
        <wsin:CorrelationId th:text="${correlationId}">?</wsin:CorrelationId>
    </soapenv:Header>
    <soapenv:Body>
        <wsin:CreateClientAddressV2>
            <wsin:ClientSearchMethod>CLIENT_ID</wsin:ClientSearchMethod>
            <wsin:ClientIdentifier th:text="${clientId}">1</wsin:ClientIdentifier>
            <wsin:AddressTypeCode th:text="${addressInfo.addressType}">STMT</wsin:AddressTypeCode>
            <wsin:Reason th:text="${reason}">Create client address</wsin:Reason>
            <InObject>
                <City th:text="${addressInfo.city}">Meschede</City>
                <ZipCode th:text="${addressInfo.addressZip}">***</ZipCode>
                <Line1 th:text="${addressInfo.addressLine1}">***</Line1>
                <Line2 th:text="${addressInfo.addressLine2}">***</Line2>
                <!-- Dùng th:if/th:unless để tránh lỗi parse toán tử ? trong th:attr -->
                <Line3 th:if="${addressInfo.addressLine3 != null}" th:text="${addressInfo.addressLine3}"/>
                <Line3 th:if="${addressInfo.addressLine3 == null}" xsi:nil="true"/>
                
                <Line4 th:if="${addressInfo.addressLine4 != null}" th:text="${addressInfo.addressLine4}"/>
                <Line4 th:if="${addressInfo.addressLine4 == null}" xsi:nil="true"/>
            </InObject>
        </wsin:CreateClientAddressV2>
    </soapenv:Body>
</soapenv:Envelope>